---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCHybridImport
source: html/7f0506a4-c093-7f4b-e2d0-07df141f4767.htm
---
# Autodesk.Revit.DB.IFC.IFCHybridImport

Driver for Performing Hybrid Imports.

## Syntax (C#)
```csharp
public class IFCHybridImport : IDisposable
```